status/2021/15jan21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>09 January 2021 - 15 January 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">09 January 2021 - 15 January 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9a43085">1. Abstract schematic symbols</a></li>
<li><a href="#orga6ed56c">2. EPICS</a>
<ul>
<li><a href="#org20d3791">2.1. U3-HV input configuration abstract schematic</a></li>
</ul>
</li>
<li><a href="#org76c1b58">3. Brini Tracker II</a></li>
<li><a href="#orge67b347">4. Dodecahedron</a></li>
<li><a href="#orgcfd2a46">5. ca-r</a></li>
<li><a href="#org50a4405">6. GEOS</a></li>
<li><a href="#org0d85407">7. Books</a>
<ul>
<li><a href="#org1d1c74a">7.1. A Mathematician Reads The Newspaper</a></li>
<li><a href="#org34f02e8">7.2. The Logic of Failure</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Sedition fallout
</p>

<div id="outline-container-org9a43085" class="outline-2">
<h2 id="org9a43085"><span class="section-number-2">1.</span> Abstract schematic symbols</h2>
<div class="outline-text-2" id="text-1">
<p>
Started. Seems to more-or-less work, but the OR symbols aren't perfect.
</p>

<p>
<a href="https://github.com/daniel-kelley/kicad-generic-digital">https://github.com/daniel-kelley/kicad-generic-digital</a>
</p>

<p>
The math for the OR symbols seems to be sorted out, but took longer
than expected.
</p>
</div>
</div>

<div id="outline-container-orga6ed56c" class="outline-2">
<h2 id="orga6ed56c"><span class="section-number-2">2.</span> EPICS</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org20d3791" class="outline-3">
<h3 id="org20d3791"><span class="section-number-3">2.1.</span> U3-HV input configuration abstract schematic</h3>
</div>
</div>

<div id="outline-container-org76c1b58" class="outline-2">
<h2 id="org76c1b58"><span class="section-number-2">3.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-3">
<p>
Seems to have hung up as the display is no longer responsive.
</p>
</div>
</div>

<div id="outline-container-orge67b347" class="outline-2">
<h2 id="orge67b347"><span class="section-number-2">4.</span> Dodecahedron</h2>
<div class="outline-text-2" id="text-4">
<p>
Worked out a 4-coloring. How to do this programmatically? How many
distinct 4-colorings are there?
</p>
</div>
</div>

<div id="outline-container-orgcfd2a46" class="outline-2">
<h2 id="orgcfd2a46"><span class="section-number-2">5.</span> ca-r</h2>
<div class="outline-text-2" id="text-5">
<p>
Want to add tier data. Likely to be a PITA because the data file
location changes when updated.
</p>
</div>
</div>

<div id="outline-container-org50a4405" class="outline-2">
<h2 id="org50a4405"><span class="section-number-2">6.</span> GEOS</h2>
<div class="outline-text-2" id="text-6">
<p>
Started studying the GOES 2D geometry API.
</p>
</div>
</div>

<div id="outline-container-org0d85407" class="outline-2">
<h2 id="org0d85407"><span class="section-number-2">7.</span> Books</h2>
<div class="outline-text-2" id="text-7">
<p>
Finished a couple of classics from my library:
</p>
</div>
<div id="outline-container-org1d1c74a" class="outline-3">
<h3 id="org1d1c74a"><span class="section-number-3">7.1.</span> A Mathematician Reads The Newspaper</h3>
<div class="outline-text-3" id="text-7-1">
<p>
<a href="https://www.barnesandnoble.com/w/a-mathematician-reads-the-newspaper-john-allen-paulos/1000285396">https://www.barnesandnoble.com/w/a-mathematician-reads-the-newspaper-john-allen-paulos/1000285396</a>
</p>
</div>
</div>
<div id="outline-container-org34f02e8" class="outline-3">
<h3 id="org34f02e8"><span class="section-number-3">7.2.</span> The Logic of Failure</h3>
<div class="outline-text-3" id="text-7-2">
<p>
<a href="https://www.barnesandnoble.com/w/the-logic-of-failure-dietrich-dorner/1113141155?ean=9780201479485">https://www.barnesandnoble.com/w/the-logic-of-failure-dietrich-dorner/1113141155?ean=9780201479485</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
